zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/MCXW236/fsl_power_lib/fsl_system_lib.c
/*
 * Copyright 2022-2025 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */
#include "fsl_device_registers.h"
#include "fsl_common.h"
#include "fsl_system.h"
#include "fsl_gpio.h"
#include "fsl_debug_console.h"

/*******************************************************************************
 * Definitions
 ******************************************************************************/

#define kFREQMEAS_target_clock_32MHz_XTAL (0U)

/* typical values from datasheet */
#define kSTEPSIZE_1MHZ_FRO_PPM  (5000)
#define kSTEPSIZE_12MHZ_FRO_PPM (1200)
#define kSTEPSIZE_32KHZ_FRO_PPM (2000)
#define kFREQ_1MHZ              (1000000)
#define kFREQ_12MHZ             (12000000)
#define kFREQ_32MHZ             (32000000)
#define kFREQ_32KHZ             (32768)
#define KSTEPSIZE_1MHZ          (int32_t)((kSTEPSIZE_1MHZ_FRO_PPM * (int64_t)kFREQ_1MHZ) / 1000000)
#define KSTEPSIZE_12MHZ         (int32_t)((kSTEPSIZE_12MHZ_FRO_PPM * (int64_t)kFREQ_12MHZ) / 1000000)
#define KSTEPSIZE_32KHZ         ((kSTEPSIZE_32KHZ_FRO_PPM * kFREQ_32KHZ) / 1000000)
#define kRTC_TARGET_1KHZ        (993)
#define kRTC_TARGET_1HZ         (1)

#define PMC_RTCOSC32K_CLK1KHZDIV_MAX    (PMC_RTCOSC32K_CLK1KHZDIV_MASK >> PMC_RTCOSC32K_CLK1KHZDIV_SHIFT)
#define PMC_RTCOSC32K_CLK1KHZDIV_MIN    (0)
#define PMC_RTCOSC32K_CLK1HZDIV_MAX     (PMC_RTCOSC32K_CLK1HZDIV_MASK >> PMC_RTCOSC32K_CLK1HZDIV_SHIFT)
#define PMC_RTCOSC32K_CLK1HZDIV_MIN     (0)
#define PMC_RTCOSC32K_CLK1KHZDIV_OFFSET (28)
#define PMC_RTCOSC32K_CLK1HZDIV_OFFSET  (31744)

/*******************************************************************************
 * Variables
 ******************************************************************************/

static const uint32_t threshold[kFREQMEAS_ref_time_exp_31 + 1] = {
    /*ppm 32.768kHz  ppm 12MHz  ppm 1MHz*/
    0xffffffff, /*  0 */
    0xffffffff, /*  1 */
    0xffffffff, /*  2 */
    0xffffffff, /*  3 */
    0xffffffff, /*  4 */
    0xffffffff, /*  5 */
    0xffffffff, /*  6 */
    250000,     /*  kFREQMEAS_ref_time_exp_7                            20833      250000 */
    125000,     /*  kFREQMEAS_ref_time_exp_8                            10417      125000 */
    62500,      /*  kFREQMEAS_ref_time_exp_9                            5208       62500  */
    31250,      /*  kFREQMEAS_ref_time_exp_10               953674      2604       31250  */
    15625,      /*  kFREQMEAS_ref_time_exp_11               476837      1302       15625  */
    7813,       /*  kFREQMEAS_ref_time_exp_12               238419      651        7813   */
    3906,       /*  kFREQMEAS_ref_time_exp_13               119209      326        3906   */
    1953,       /*  kFREQMEAS_ref_time_exp_14               59605       163        1953   */
    977,        /*  kFREQMEAS_ref_time_exp_15               29802       81         977    */
    488,        /*  kFREQMEAS_ref_time_exp_16               14901       41         488    */
    244,        /*  kFREQMEAS_ref_time_exp_17               7451        20         244    */
    122,        /*  kFREQMEAS_ref_time_exp_18               3725        10         122    */
    61,         /*  kFREQMEAS_ref_time_exp_19               1863        5          61     */
    31,         /*  kFREQMEAS_ref_time_exp_20               931         3          31     */
    15,         /*  kFREQMEAS_ref_time_exp_21               466         1          15     */
    8,          /*  kFREQMEAS_ref_time_exp_22               233         1          8      */
    4,          /*  kFREQMEAS_ref_time_exp_23               116         0          4      */
    2,          /*  kFREQMEAS_ref_time_exp_24               58          0          2      */
    1,          /*  kFREQMEAS_ref_time_exp_25               29          0          1      */
    0,          /*  kFREQMEAS_ref_time_exp_26               15          0          0      */
    0,          /*  kFREQMEAS_ref_time_exp_27               7           0          0      */
    0,          /*  kFREQMEAS_ref_time_exp_28               4           0          0      */
    0,          /*  kFREQMEAS_ref_time_exp_29               2           0          0      */
    0,          /*  kFREQMEAS_ref_time_exp_30               1           0          0      */
    0           /*  kFREQMEAS_ref_time_exp_31               0           0          0      */
};

void pmc_delay_us(uint32_t delay)
{
#ifdef DEBUG
    if (SystemCoreClock == kFreq_12MHz)
    {
        while (delay--)
        {
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
        }
    }
    else if (SystemCoreClock == kFreq_24MHz)
    {
        while (delay--)
        {
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
        }
    }
    else if (SystemCoreClock == kFreq_32MHz)
    {
        while (delay--)
        {
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
        }
    }
#else
    if (SystemCoreClock == kFreq_12MHz)
    {
        while (delay--)
        {
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
        }
    }
    else if (SystemCoreClock == kFreq_24MHz)
    {
        while (delay--)
        {
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
        }
    }
    else if (SystemCoreClock == kFreq_32MHz)
    {
        while (delay--)
        {
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
        }
    }
#endif
}

