zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/MCXW236/fsl_power_lib/fsl_system_lib.c
static uint32_t CountCycles(freq_meas_target_clock_t target_clock,
                            freq_meas_ref_time_exponent_t ref_clock_power_of_2_cycles)
{
    /* Save relevant potentially altered registers */
    uint32_t Pdruncfg0        = PMC->PDRUNCFG0;
    uint32_t SysconClock_Ctrl = SYSCON->CLOCK_CTRL;
    uint32_t AHBClkCtrl0      = SYSCON->AHBCLKCTRL.AHBCLKCTRL0; /* For CLOCK_EnableClock functions */
    uint32_t AHBClkCtrl1      = SYSCON->AHBCLKCTRL.AHBCLKCTRL1; /* For CLOCK_EnableClock functions */
    uint32_t AHBClkCtrl2      = SYSCON->AHBCLKCTRL.AHBCLKCTRL2; /* For CLOCK_EnableClock functions */

    /* Enable BLE clock / CLKIN clock / 32MHz XTAL clock if not enabled yet */
    PMC->PDRUNCFGCLR0 = PMC_PDRUNCFG0_PDEN_BLE_MASK;

#define BLE_STATE ((PMC->STATUS & PMC_STATUS_FSMBLESTATE_MASK) >> PMC_STATUS_FSMBLESTATE_SHIFT)
    while ((BLE_STATE != 2) && (BLE_STATE != 6)) /* most probably not required seen the delays above */
    {
    } /* Wait until 32 MHz xtal osc is active */
    SYSCON->CLOCK_CTRL |= SYSCON_CLOCK_CTRL_XTAL32MHZ_FREQM_ENA_MASK;

    CLOCK_EnableClock(kCLOCK_Freqme);
    CLOCK_EnableClock(kCLOCK_InputMux);
    CLOCK_EnableClock(kCLOCK_AnalogCtrl);

    /* Use 32MHZ_XTAL as reference.  Note: e.g 32.768kHz FRO: duration can be halved for same resolution (tested on
     * FPGA) by swapping ref with target, but duration needs to be re-calculated */
    INPUTMUX->FREQMEAS_REF = kFREQMEAS_target_clock_32MHz_XTAL << INPUTMUX_FREQMEAS_REF_CLKIN_SHIFT;

    INPUTMUX->FREQMEAS_TARGET = target_clock << INPUTMUX_FREQMEAS_TARGET_CLKIN_SHIFT;
    /* Set scale and start measurement (must be done in one go, cannot use read-modify-write as read and write point to
     * different physical registers) */
    ANACTRL->FREQ_ME_CTRL =
        ANACTRL_FREQ_ME_CTRL_PROG_MASK | (ref_clock_power_of_2_cycles << ANACTRL_FREQ_ME_CTRL_CAPVAL_SCALE_SHIFT);
    /* wait till measurement done - should take 2^ref_clock_power_of_2_cycles-1 ref clock cycles -  2.05 ms */
    while (ANACTRL->FREQ_ME_CTRL & ANACTRL_FREQ_ME_CTRL_PROG_MASK)
        ;
    /* Now get the value */
    uint32_t val = ANACTRL->FREQ_ME_CTRL;
    if (val > 0)
    {
        val += 1; /* I guess you have to add one because of ...  hw sync delay of start signal maybe? */
    }
    /* Restore relevant potentially altered registers */
    SYSCON->AHBCLKCTRL.AHBCLKCTRL0 = AHBClkCtrl0;
    SYSCON->AHBCLKCTRL.AHBCLKCTRL1 = AHBClkCtrl1;
    SYSCON->AHBCLKCTRL.AHBCLKCTRL2 = AHBClkCtrl2;
    SYSCON->CLOCK_CTRL             = SysconClock_Ctrl;
    PMC->PDRUNCFG0                 = Pdruncfg0;

    return val;
}

/*!
 * @brief Measures and corrects frequency of 32.768kHz FRO referenced to 32MHz XTAL oscillator.
 *
 * @param ref_clock_power_of_2_cycles
 * @return freq         Clock frequency in Hz
 *
 */
static void MeasureAndCorrect32kHzFRO(freq_meas_ref_time_exponent_t ref_clock_power_of_2_cycles)
{
    uint32_t capcal = (PMC->FRO32K & PMC_FRO32K_CAPCAL_MASK) >> PMC_FRO32K_CAPCAL_SHIFT;
    uint32_t freq   = SYSTEM_MeasureFrequency(kFREQMEAS_target_clock_32kHz_FRO, ref_clock_power_of_2_cycles);
    /* Error calculation */
    int32_t error = freq - kFREQ_32KHZ;

    /*
     * some rules:
     * -1- do not correct when below measurement accuracy
     * -2- subtract half of the measurement accuracy to not make things worse
     * -3- do not correct below 1/2 step
     */
    if (abs(error) > threshold[ref_clock_power_of_2_cycles]) // rule -1-
    {
        int32_t correction;
        if (error > 0)
        {
            error -= (threshold[ref_clock_power_of_2_cycles] >> 1);       // rule -2-
            correction = (error + KSTEPSIZE_32KHZ / 2) / KSTEPSIZE_32KHZ; // rule -3-
        }
        else
        {
            error += (threshold[ref_clock_power_of_2_cycles] >> 1);       // rule -2-
            correction = (error - KSTEPSIZE_32KHZ / 2) / KSTEPSIZE_32KHZ; // rule -3-
        }
        /* Do correction */
        capcal          = (uint32_t)((int32_t)capcal + correction);
        uint32_t fro32k = PMC->FRO32K;
        fro32k &= ~(PMC_FRO32K_CAPCAL_MASK);
        fro32k |= PMC_FRO32K_CAPCAL(capcal);
        PMC->FRO32K = fro32k;
    }
}

/*!
 * @brief Measures frequency of 32.768kHz FRO referenced to 32MHz XTAL oscillator and corrects RTC dividers.
 * Correction aims to be as close as possible to targets 1Hz and 32768/33 = 993Hz.
 *
 * @param ref_clock_power_of_2_cycles
 */
static void MeasureAndCorrect32kHzRTCdividers(freq_meas_ref_time_exponent_t ref_clock_power_of_2_cycles)
{
    uint32_t val = CountCycles(kFREQMEAS_target_clock_32kHz_FRO, ref_clock_power_of_2_cycles);
    /* Calculate frequency in mHz */
    int32_t freq_in_mHz = (int32_t)(((uint64_t)val * kFREQ_32MHZ * 1000) / ((1 << ref_clock_power_of_2_cycles) - 1));

    int32_t setting_1kHz =
        (freq_in_mHz + kRTC_TARGET_1KHZ * (1000 / 2)) / (kRTC_TARGET_1KHZ * 1000) - PMC_RTCOSC32K_CLK1KHZDIV_OFFSET;
    if (setting_1kHz < PMC_RTCOSC32K_CLK1KHZDIV_MIN)
        setting_1kHz = PMC_RTCOSC32K_CLK1KHZDIV_MIN;
    if (setting_1kHz > PMC_RTCOSC32K_CLK1KHZDIV_MAX)
        setting_1kHz = PMC_RTCOSC32K_CLK1KHZDIV_MAX;

    int32_t setting_1Hz =
        (freq_in_mHz + kRTC_TARGET_1HZ * (1000 / 2)) / (kRTC_TARGET_1HZ * 1000) - PMC_RTCOSC32K_CLK1HZDIV_OFFSET;
    if (setting_1Hz < PMC_RTCOSC32K_CLK1HZDIV_MIN)
        setting_1Hz = PMC_RTCOSC32K_CLK1HZDIV_MIN;
    if (setting_1Hz > PMC_RTCOSC32K_CLK1HZDIV_MAX)
        setting_1Hz = PMC_RTCOSC32K_CLK1HZDIV_MAX;

    /* Do correction */
    uint32_t rtcosc32k = PMC->RTCOSC32K;
    rtcosc32k &= ~(PMC_RTCOSC32K_CLK1KHZDIV_MASK | PMC_RTCOSC32K_CLK1HZDIV_MASK);
    rtcosc32k |= (PMC_RTCOSC32K_CLK1KHZDIV(setting_1kHz) | PMC_RTCOSC32K_CLK1HZDIV(setting_1Hz));
    PMC->RTCOSC32K = rtcosc32k;
}

/*!
 * @brief Measures 12MHz FRO output and corrects frequency of 192MHz FRO referenced to 32MHz XTAL oscillator.
 *
 * @param ref_clock_power_of_2_cycles
 */
static void MeasureAndCorrect12MHzFRO(freq_meas_ref_time_exponent_t ref_clock_power_of_2_cycles)
{
    uint32_t curdac = (PMC->FRO192M & PMC_FRO192M_CUR_DAC_MASK) >>
                      PMC_FRO192M_CUR_DAC_SHIFT; /* fine, 8 bits, increase value is increase frequency, 1 step = 215 kHz
                                                    on 192MHz or 0.12% */
    uint32_t freq = SYSTEM_MeasureFrequency(kFREQMEAS_target_clock_12_24_32MHz_FRO, ref_clock_power_of_2_cycles);
    /* Error calculation */
    int32_t error = freq - kFREQ_12MHZ;

