zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/MCXW236/fsl_power_lib/fsl_system_lib.c
    /*
     * some rules:
     * -1- do not correct when below measurement accuracy
     * -2- subtract half of the measurement accuracy to not make things worse
     * -3- do not correct below 1/2 step
     */
    if (abs(error) > threshold[ref_clock_power_of_2_cycles]) // rule -1-
    {
        int32_t correction;
        if (error > 0)
        {
            error -= (threshold[ref_clock_power_of_2_cycles] >> 1);       // rule -2-
            correction = (error + KSTEPSIZE_12MHZ / 2) / KSTEPSIZE_12MHZ; // rule -3-
        }
        else
        {
            error += (threshold[ref_clock_power_of_2_cycles] >> 1);       // rule -2-
            correction = (error - KSTEPSIZE_12MHZ / 2) / KSTEPSIZE_12MHZ; // rule -3-
        }
        /* Do fine correction */
        curdac           = (uint32_t)((int32_t)curdac - correction);
        uint32_t fro192m = PMC->FRO192M;
        fro192m &= ~(PMC_FRO192M_CUR_DAC_MASK);
        fro192m |= PMC_FRO192M_CUR_DAC(curdac);
        PMC->FRO192M = fro192m;
    }
}

/*!
 * @brief Measures and corrects frequency of 1MHz FRO referenced to 32MHz XTAL oscillator.
 *
 * @param ref_clock_power_of_2_cycles
 */
static void MeasureAndCorrect1MHzFRO(freq_meas_ref_time_exponent_t ref_clock_power_of_2_cycles)
{
    uint32_t freqsel = (PMC->FRO1M & PMC_FRO1M_FREQSEL_MASK) >>
                       PMC_FRO1M_FREQSEL_SHIFT; /* 7 bits, increase value is increase frequency */
    uint32_t freq = SYSTEM_MeasureFrequency(kFREQMEAS_target_clock_1MHz_FRO, ref_clock_power_of_2_cycles);
    /* Error calculation */
    int32_t error = (int32_t)freq - kFREQ_1MHZ;
    /*
     * some rules:
     * -1- do not correct when below measurement accuracy
     * -2- subtract half of the measurement accuracy to not make things worse
     * -3- do not correct below 1/2 step
     */
    if (abs(error) > threshold[ref_clock_power_of_2_cycles]) // rule -1-
    {
        int32_t correction;
        if (error > 0)
        {
            error -= (threshold[ref_clock_power_of_2_cycles] >> 1);     // rule -2-
            correction = (error + KSTEPSIZE_1MHZ / 2) / KSTEPSIZE_1MHZ; // rule -3-
        }
        else
        {
            error += (threshold[ref_clock_power_of_2_cycles] >> 1);     // rule -2-
            correction = (error - KSTEPSIZE_1MHZ / 2) / KSTEPSIZE_1MHZ; // rule -3-
        }
        /* Do correction */
        freqsel        = (uint32_t)((int32_t)freqsel + correction);
        uint32_t fro1m = PMC->FRO1M;
        fro1m &= ~(PMC_FRO1M_FREQSEL_MASK);
        fro1m |= PMC_FRO1M_FREQSEL(freqsel);
        PMC->FRO1M = fro1m;
    }
}

/*******************************************************************************
 * Functions
 ******************************************************************************/
uint32_t SYSTEM_MeasureFrequency32kHzAccurate(freq_meas_ref_time_exponent_t ref_clock_power_of_2_cycles)
{
    uint32_t freq_in_mHz = 0;

    /* Save relevant potentially altered registers */
    uint32_t Pdruncfg0            = PMC->PDRUNCFG0;
    uint32_t SysconClock_Ctrl     = SYSCON->CLOCK_CTRL;
    uint32_t SavedSystemCoreClock = SystemCoreClock;

    /* Enable BLE clock / CLKIN clock / 32MHz XTAL clock already here to gain time */
    PMC->PDRUNCFGCLR0 = PMC_PDRUNCFG0_PDEN_BLE_MASK;

    uint32_t val = CountCycles(kFREQMEAS_target_clock_32kHz_FRO, ref_clock_power_of_2_cycles);
    /* Calculate frequency in mHz */
    freq_in_mHz = (uint32_t)(((uint64_t)val * kFREQ_32MHZ * 1000) / ((1 << ref_clock_power_of_2_cycles) - 1));

    /* Restore relevant potentially altered registers */
    SystemCoreClock    = SavedSystemCoreClock;
    SYSCON->CLOCK_CTRL = SysconClock_Ctrl;
    PMC->PDRUNCFG0     = Pdruncfg0;

    return freq_in_mHz;
}

uint32_t SYSTEM_MeasureFrequency(freq_meas_target_clock_t target_clock,
                                 freq_meas_ref_time_exponent_t ref_clock_power_of_2_cycles)
{
    uint32_t freq = 0;

    /* Save relevant potentially altered registers */
    uint32_t Pdruncfg0            = PMC->PDRUNCFG0;
    uint32_t SysconClock_Ctrl     = SYSCON->CLOCK_CTRL;
    uint32_t PmcRTCOsc32k         = PMC->RTCOSC32K;
    uint32_t Fro192M_ctrl         = ANACTRL->FRO192M_CTRL;
    uint32_t SavedSystemCoreClock = SystemCoreClock;

    /* Enable BLE clock / CLKIN clock / 32MHz XTAL clock already here to gain time */
    PMC->PDRUNCFGCLR0 = PMC_PDRUNCFG0_PDEN_BLE_MASK;

    if (target_clock == kFREQMEAS_target_clock_32kHz_FRO)
    {
        PMC->PDRUNCFG0 &= ~(PMC_PDRUNCFG0_PDEN_FRO32K_MASK);
        pmc_delay_us(100);                      /* startup time of FRO32kHz? spec: max 100us to be within +/-2.2% */
        PMC->RTCOSC32K |= PMC_RTCOSC32K_SEL(0); /* use 32 kHz fro as 32k osc */
        pmc_delay_us(100);                      /* delay 3 32kHz cycles to switch (and increase accuracy) */
    }
    else if (target_clock == kFREQMEAS_target_clock_12_24_32MHz_FRO)
    {
        PMC->PDRUNCFGCLR0 = PMC_PDRUNCFG0_PDEN_FRO192M_MASK;
        pmc_delay_us(100); /* startup time of FRO192MHz? spec: 15us time it takes to release clock after enable */
        ANACTRL->FRO192M_CTRL = Fro192M_ctrl | ANACTRL_FRO192M_CTRL_ENA_12MHZCLK_MASK;
        SYSCON->CLOCK_CTRL |= SYSCON_CLOCK_CTRL_FRO12MHZ_FREQM_ENA_MASK;
    }
    else if (target_clock == kFREQMEAS_target_clock_1MHz_FRO)
    {
        PMC->PDRUNCFGCLR0 = PMC_PDRUNCFG0_PDEN_FRO1M_MASK;
        pmc_delay_us(2000); /* startup time of FRO1MHz?  spec: 25us till 10% of final value.
        From experiments: 2000us is ok  1500 nok  this is with PMC running on 1MHz FRO which is already running -
        probably ldo stabilization time after previous activity
        200us FRO startup time measured to stabilize within one correction step when PMC is running on 12MHz */
        SYSCON->CLOCK_CTRL |= SYSCON_CLOCK_CTRL_FRO1MHZ_UTICK_ENA_MASK; /* really needed? Yes! */
        SYSCON->CLOCK_CTRL |= SYSCON_CLOCK_CTRL_FRO1MHZ_CLK_ENA_MASK;
    }
    else
    {
        goto func_exit;
    }

    uint32_t val = CountCycles(target_clock, ref_clock_power_of_2_cycles);

