zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/MCXW236/fsl_power_lib/fsl_system_lib.c
    /* Calculate frequency in Hz */
    freq = (uint32_t)(((uint64_t)val * kFREQ_32MHZ) / ((1 << ref_clock_power_of_2_cycles) - 1));

func_exit:
    /* Restore relevant potentially altered registers */
    SystemCoreClock       = SavedSystemCoreClock;
    ANACTRL->FRO192M_CTRL = Fro192M_ctrl;
    PMC->RTCOSC32K        = PmcRTCOsc32k;
    SYSCON->CLOCK_CTRL    = SysconClock_Ctrl;
    PMC->PDRUNCFG0        = Pdruncfg0;

    return freq;
}

/*!
 * @brief Calibrates clock referenced to 32MHz XTAL oscillator using a successive calibration algorithm for large
 * deviations.
 *
 * @param target_clock  Clock to calibrate.
 */
void SYSTEM_CalibrateClock(freq_meas_target_clock_t targetClock)
{
    /*
     * successive approximation algorithm:
     *  - start with a short coarse measurement of the error
     *  - gradually go finer each step
     */
    if (targetClock == kFREQMEAS_target_clock_32kHz_FRO)
    {
        /*
         *  - This works when the deviation of capcal from 0.2% is not too big.  If not we have to review this.
         */
        MeasureAndCorrect32kHzFRO(kFREQMEAS_ref_time_exp_17);
        MeasureAndCorrect32kHzFRO(kFREQMEAS_ref_time_exp_18);
        MeasureAndCorrect32kHzFRO(kFREQMEAS_ref_time_exp_19);
        MeasureAndCorrect32kHzFRO(kFREQMEAS_ref_time_exp_20); /* 33 ms measurement */
    }
    else if (targetClock == kFREQMEAS_target_clock_12_24_32MHz_FRO)
    {
        MeasureAndCorrect12MHzFRO(kFREQMEAS_ref_time_exp_7);
        MeasureAndCorrect12MHzFRO(kFREQMEAS_ref_time_exp_8);
        MeasureAndCorrect12MHzFRO(kFREQMEAS_ref_time_exp_9);
        MeasureAndCorrect12MHzFRO(kFREQMEAS_ref_time_exp_10);
        MeasureAndCorrect12MHzFRO(kFREQMEAS_ref_time_exp_11);
        MeasureAndCorrect12MHzFRO(kFREQMEAS_ref_time_exp_12);
        MeasureAndCorrect12MHzFRO(kFREQMEAS_ref_time_exp_13);
    }
    else if (targetClock == kFREQMEAS_target_clock_1MHz_FRO)
    {
        MeasureAndCorrect1MHzFRO(kFREQMEAS_ref_time_exp_7);
        MeasureAndCorrect1MHzFRO(kFREQMEAS_ref_time_exp_8);
        MeasureAndCorrect1MHzFRO(kFREQMEAS_ref_time_exp_9);
        MeasureAndCorrect1MHzFRO(kFREQMEAS_ref_time_exp_10);
        MeasureAndCorrect1MHzFRO(kFREQMEAS_ref_time_exp_11);
        MeasureAndCorrect1MHzFRO(kFREQMEAS_ref_time_exp_12);
        MeasureAndCorrect1MHzFRO(kFREQMEAS_ref_time_exp_13);
        MeasureAndCorrect1MHzFRO(kFREQMEAS_ref_time_exp_14);
    }
}

/*!
 * @brief Calibrates clock referenced to 32MHz XTAL oscillator for small deviations.
 *
 * @param target_clock  Clock to calibrate.
 */
void SYSTEM_CalibrateClockFine(freq_meas_target_clock_t targetClock)
{
    if (targetClock == kFREQMEAS_target_clock_32kHz_FRO)
    {
        MeasureAndCorrect32kHzFRO(kFREQMEAS_ref_time_exp_20);
    }
    else if (targetClock == kFREQMEAS_target_clock_12_24_32MHz_FRO)
    {
        MeasureAndCorrect12MHzFRO(kFREQMEAS_ref_time_exp_13);
    }
    else if (targetClock == kFREQMEAS_target_clock_1MHz_FRO)
    {
        MeasureAndCorrect1MHzFRO(kFREQMEAS_ref_time_exp_14);
    }
}

/*!
 * @brief Calibrates RTC clock dividers referenced to 32MHz XTAL oscillator
 *
 * @param None
 */
void SYSTEM_CalibrateRTCClockDividers(void)
{
    MeasureAndCorrect32kHzRTCdividers(kFREQMEAS_ref_time_exp_27); /* 4224 ms measurement - 7 ppm*/
}

/*!
 * @brief Assembles chip version from Flash and/or hardware registers
 *
 * @return chip version.
 */
chip_version_t SYSTEM_GetChipVersion(void)
{
    chip_version_t chipVersion = kCHIPVERSION_UNKNOWN;
    uint32_t metalFixNr        = ((uint32_t)FLASH_NMPA->GPO1.GPO1_0 & FLASH_NMPA_GPO1_0_METAL_REVISION_ID_MASK) >>
                          FLASH_NMPA_GPO1_0_METAL_REVISION_ID_SHIFT;
    uint32_t netListNr = (SYSCON->DEVICE_ID0 & SYSCON_DEVICE_ID0_PARTCONFIG_MASK) >> SYSCON_DEVICE_ID0_PARTCONFIG_SHIFT;
    chipVersion = metalFixNr | 0xA0;
    return chipVersion;
}

void SYSTEM_GetDeviceType(uint16_t *typeNr, bool *securityEnabled, chip_package_type_t *packageType, uint8_t *nrOfPins)
{
    FLASH_NMPA_Type *nmpa = ((FLASH_NMPA_Type *)(FLASH_NMPA_BASE));
    *typeNr               = (uint16_t)((nmpa->DEVICE_TYPE & FLASH_NMPA_DEVICE_TYPE_DEVICE_TYPE_NUM_MASK) >>
                         FLASH_NMPA_DEVICE_TYPE_DEVICE_TYPE_NUM_SHIFT);
    *securityEnabled      = (bool)((nmpa->DEVICE_TYPE & FLASH_NMPA_DEVICE_TYPE_DEVICE_TYPE_SEC_MASK) >>
                              FLASH_NMPA_DEVICE_TYPE_DEVICE_TYPE_SEC_SHIFT);
    *packageType          = (uint8_t)((nmpa->DEVICE_TYPE & FLASH_NMPA_DEVICE_TYPE_DEVICE_TYPE_PKG_MASK) >>
                             FLASH_NMPA_DEVICE_TYPE_DEVICE_TYPE_PKG_SHIFT);
    *nrOfPins             = (uint8_t)((nmpa->DEVICE_TYPE & FLASH_NMPA_DEVICE_TYPE_DEVICE_TYPE_PIN_MASK) >>
                          FLASH_NMPA_DEVICE_TYPE_DEVICE_TYPE_PIN_SHIFT);
}
